CSI API ETABS v1
cDatabaseTables.GetLoadPatternsSelectedForDisplay Method
 Returns a list of load patterns that are selected for table display.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadPatternsSelectedForDisplay(
	ref int NumberSelectedLoadPatterns,
	ref string[] LoadPatternList
)
Function GetLoadPatternsSelectedForDisplay (
	ByRef NumberSelectedLoadPatterns As Integer,
	ByRef LoadPatternList As String()
) As Integer
Dim instance As cDatabaseTables
Dim NumberSelectedLoadPatterns As Integer
Dim LoadPatternList As String()
Dim returnValue As Integer
returnValue = instance.GetLoadPatternsSelectedForDisplay(NumberSelectedLoadPatterns,
	LoadPatternList)
int GetLoadPatternsSelectedForDisplay(
	int% NumberSelectedLoadPatterns,
	array<String^>^% LoadPatternList
)
abstract GetLoadPatternsSelectedForDisplay :
        NumberSelectedLoadPatterns : int byref *
        LoadPatternList : string[] byref -> int
Parameters
NumberSelectedLoadPatterns
Type: System.Int32
Returned Item: The number of load patterns selected for table display.
LoadPatternList
Type: System.String[]
Returned Item: The zero-based list of load patterns selected for table display.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
This list sets the load patterns that are included when displaying load assignments on the model.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace